/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   monitor.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jim <jim@student.42seoul.kr>               +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/12 20:38:00 by jim               #+#    #+#             */
/*   Updated: 2022/05/14 18:38:09 by jim              ###   ########seoul.kr  */
/*                                                                            */
/* ************************************************************************** */

#include "philo_struct.h"

int	monitoring(t_status *status_info)
{
	/*
		- 밥 다 먹었는지?
		-
	*/
	(void)status_info;
	while (TRUE)
	{
		usleep(1000);
	}
	return (TRUE);
}
